import React from "react";

import "slick-carousel/slick/slick.css";
import "slick-carousel/slick/slick-theme.css";
import Slider from "react-slick";

const SmIntelInfo = () => {
  const settings = {
    dots: true,
    infinite: true,
    autoplay: false,
    speed: 500,
    slidesToShow: 1,
    slidesToScroll: 1,
    responsive: [
      {
        breakpoint: 600,
        settings: {
          slidesToShow: 1,
          slidesToScroll: 1,
          initialSlide: 1,
        },
      },
    ],
  };

  return (
    <div>
      <Slider {...settings} className="smIntel__slider mb-[3rem]">
        <div className="w-[190px] px-[80px] h-[395px]  border-neutral-500 flex items-center justify-center">
          <div className="bg-[#F5F5F7] rounded-xl min-h-full min-w-full px-[2rem] py-[1.75rem]">
            <div className="w-[126px] h-[126px] bg-[#0071E3] rounded-[9.79px] flex flex-col items-center pt-[1.86rem] mb-[1.5rem]">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="97"
                height="41"
                viewBox="0 0 97 41"
                fill="none"
                className="mb-[0.49rem]"
              >
                <path
                  d="M0.679688 1.35451H8.25122V8.68558H0.679688V1.35451ZM8.06261 39.5491V13.1207H0.868302V39.523H8.06261V39.5491ZM55.7013 39.81V33.3399C54.6505 33.3399 53.7613 33.2877 53.1146 33.1833C52.3601 33.079 51.7943 32.8181 51.4171 32.4528C51.0398 32.0876 50.7973 31.5658 50.6626 30.8614C50.5548 30.2092 50.5009 29.3482 50.5009 28.3046V19.0952H55.7013V13.1207H50.5009V2.8416H43.3066V28.3829C43.3066 30.5483 43.4952 32.3746 43.8725 33.8356C44.2497 35.2705 44.8964 36.4445 45.7856 37.3315C46.6748 38.2185 47.8603 38.8447 49.2884 39.236C50.7435 39.6273 52.5757 39.81 54.7582 39.81H55.7013ZM96.8732 39.5491V0.806641H89.6789V39.5491H96.8732ZM36.3818 15.7297C34.3878 13.6425 31.5856 12.599 28.0288 12.599C26.3044 12.599 24.7146 12.9381 23.3135 13.6164C21.8854 14.2948 20.6998 15.234 19.7298 16.4341L19.3526 16.9298V13.1207H12.266V39.523H19.4064V25.4609V25.9566C19.4873 23.4781 20.107 21.6519 21.2926 20.4779C22.559 19.2256 24.0949 18.5995 25.8463 18.5995C27.9211 18.5995 29.5108 19.2256 30.5617 20.4257C31.5856 21.6258 32.1245 23.3216 32.1245 25.487V39.523H39.3727V24.5478C39.3996 20.791 38.3757 17.8168 36.3818 15.7297ZM85.9605 26.2958C85.9605 24.3913 85.6102 22.6172 84.9366 20.9475C84.236 19.3039 83.266 17.8429 82.0535 16.5906C80.814 15.3383 79.3321 14.373 77.6076 13.6686C75.8831 12.9642 73.97 12.625 71.8952 12.625C69.9283 12.625 68.0691 12.9903 66.3446 13.6947C64.6201 14.4252 63.1112 15.3905 61.8448 16.6167C60.5784 17.8429 59.5545 19.3039 58.8269 20.9736C58.0725 22.6433 57.7222 24.4434 57.7222 26.348C57.7222 28.2525 58.0725 30.0526 58.773 31.7223C59.4736 33.392 60.4706 34.853 61.71 36.0792C62.9495 37.3054 64.4854 38.2968 66.2638 39.0012C68.0421 39.7317 70.0091 40.097 72.1108 40.097C78.2004 40.097 81.9727 37.4098 84.236 34.9052L79.0626 31.0962C77.9848 32.3485 75.3981 34.0443 72.1647 34.0443C70.1438 34.0443 68.4732 33.6007 67.2068 32.6876C65.9404 31.8006 65.0782 30.5483 64.6201 29.0091L64.5393 28.7743H85.9605V26.2958ZM64.5932 23.8695C64.5932 21.9389 66.8835 18.5734 71.8144 18.5473C76.7453 18.5473 79.0626 21.9128 79.0626 23.8434L64.5932 23.8695Z"
                  fill="white"
                />
              </svg>
              <div className="text-center text-blue-200 text-lg font-semibold font-['SF Pro Display'] leading-[18px]">i5-14600K</div>
            </div>
            <div className="w-[126px] text-neutral-500 text-[17px] font-bold font-['SF Pro Display'] leading-[21px]">14 ядер CPU<br/><br/>20 потоков<br/><br/>Частота до<br/>5.3 ГГц<br/><br/>Поддержка<br/>DDR5 до 192GB</div>
          </div>
        </div>
        <div className="w-[190px] px-[80px] h-[395px]  border-neutral-500">
          <div className="bg-[#F5F5F7] rounded-xl min-h-full min-w-full"></div>
        </div>
      </Slider>
    </div>
  );
};

export default SmIntelInfo;
